meghamurali2324/STM32_programs/drivernew/STM32_Assignment2/Src/main.c
/**
 ******************************************************************************
 * @file           : main.c
 * @author         : Auto-generated by STM32CubeIDE
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2026 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */

#include <stdint.h>
#include "stm32f446xx.h"
#include "stm32_GPIO_Driver.h"

void delay(void)
{
    for(uint32_t i = 0; i < 250000; i++);
}

int main(void)
{
    GPIO_Handle_t led1, led2;

    led1.pGPIOx = GPIOA;							// LED1 : PORTA6
    led1.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_6;
    led1.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_OUT;
    led1.GPIO_PinConfig.GPIO_PinOPType = GPIO_OP_TYPE_PP;
    led1.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_LOW;
    led1.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;

    led2.pGPIOx = GPIOA;										    //  LED2 : PORTA7
    led2.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_7;
    led2.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_OUT;
    led2.GPIO_PinConfig.GPIO_PinOPType = GPIO_OP_TYPE_PP;
    led2.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_LOW;
    led2.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;


    //Enable Clocks
    GPIO_PeriClockControl(GPIOA, ENABLE);


    //initializing
    GPIO_Init(&led1);
    GPIO_Init(&led2);


    while(1)
    {

        GPIO_WriteToOutputPin(GPIOA, GPIO_PIN_NO_6, ENABLE);						        //LED1 ON
        GPIO_WriteToOutputPin(GPIOA, GPIO_PIN_NO_7, DISABLE);								//LED2 OFF
        delay();

        GPIO_WriteToOutputPin(GPIOA, GPIO_PIN_NO_6, DISABLE);						 		// LED1 OFF
        GPIO_WriteToOutputPin(GPIOA, GPIO_PIN_NO_7, ENABLE);								//LED ON
        delay();
    }
}

